print("Добрый день! Введите радиус круга в см")
r=int(input())
PI=3.14
l=2*PI*r
l1=l/100
s=PI*r**2
s1=s/10000
a=r*2**0.5
a1=a/100
b=r*3**0.5
b1=b/100
c=2*r
c1=c/100
d=2*r*3**0.5
d1=d/100
e=2*r*(2**0.5-1)
e1=e/100
print("Длина круга",l,"см или",l1,"м")
print("Площадь круга",s,"см**2 или",s1,"м**2")
print("Длина квадрата вписанного в окружность",a,"см или",a1,"м")
print("Длина равностороннего треугольника вписанного в окружность",b,"см или",b1,"м")
print("Длина квадрата описанного вокруг окружности",c,"см или",c1,"м")
print("Длина правильного треугольника описанного вокруг окружности",d,"см или",d1,"м")
print("Длина правильного восьмиугольника описанного вокруг окружности",e,"см или",e1,"м")


